In [1]:
import numpy as np
import pandas as pd

# Creating a DataFrame by dictionary

In [2]:
data = {
    'Name' : ['Ravi', 'Amit', 'Raghav', 'Ankit jangir','Jashanpreet singh'],
    'Age' : [23, 24, 31, 25, 21],
    'City' : ['Jaipur', 'ludhiana', 'Delhi', 'Agra', 'Noida'],
    'Salary' : [10000, 15000, 12000, 18000, 20000]
}

df = pd.DataFrame(data = data ,index = ['a', 'b', 'c', 'd', 'e'])
df

                Name  Age      City  Salary
a               Ravi   23    Jaipur   10000
b               Amit   24  ludhiana   15000
c             Raghav   31     Delhi   12000
d       Ankit jangir   25      Agra   18000
e  Jashanpreet singh   21     Noida   20000

# Creating a DataFrame by List

In [3]:
data_list = [['Ravi', 23, 'Jaipur', 10000],
    ['Amit', 24, 'ludhiana', 15000],
    ['Raghav', 31, 'Delhi', 12000],
    ['Ankit jangir', 40, 'Agra', 18000],
    ['Jashanpreet singh', 21, 'Noida', 20000]
]
df2 = pd.DataFrame(data_list, columns=['Name', 'Age', 'City', 'Salary'])
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

# Selection and indexing of column in a DataFrame

In [4]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [5]:
# name_df = df2['Name']  # Selecting the 'Name' column   
# name_df  

df_1 = pd.DataFrame(df2[['Name', 'City']]) # Selecting multiple columns
df_1

# df_2 = df2.iloc[0]  # Selecting the first row 
# df_2

                Name      City
0               Ravi    Jaipur
1               Amit  ludhiana
2             Raghav     Delhi
3       Ankit jangir      Agra
4  Jashanpreet singh     Noida

# Creating or Adding a new column in a DataFrame

In [6]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [7]:
df2["Designation"] = ['Engineer', 'Doctor', 'Teacher', 'Artist', 'Scientist']  # Creating a new column
df2

                Name  Age      City  Salary Designation
0               Ravi   23    Jaipur   10000    Engineer
1               Amit   24  ludhiana   15000      Doctor
2             Raghav   31     Delhi   12000     Teacher
3       Ankit jangir   40      Agra   18000      Artist
4  Jashanpreet singh   21     Noida   20000   Scientist

# Removing a column from a DataFrame

In [8]:
df2

                Name  Age      City  Salary Designation
0               Ravi   23    Jaipur   10000    Engineer
1               Amit   24  ludhiana   15000      Doctor
2             Raghav   31     Delhi   12000     Teacher
3       Ankit jangir   40      Agra   18000      Artist
4  Jashanpreet singh   21     Noida   20000   Scientist

In [9]:
df2.drop('Designation',axis=1,inplace=True) # inplace=True means that the changes will be applied to the original DataFrame
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [10]:
df2.drop(['City', 'Salary'], axis=1)  # Removing multiple columns
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [11]:
df2.drop(0,axis=0,)
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

# Selecting a row

In [12]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [13]:
sel_by_row = df2.loc[[0,1]] # Selecting rows by index range
sel_by_row

   Name  Age      City  Salary
0  Ravi   23    Jaipur   10000
1  Amit   24  ludhiana   15000

In [14]:
df_with_iloc = df2.iloc[3]  # Selecting rows by index range using iloc - means integer location
df_with_iloc

Name      Ankit jangir
Age                 40
City              Agra
Salary           18000
Name: 3, dtype: object

# Selecting Subsets of Rows and  Columns

In [15]:
df2.loc[[0,1]]  [["City","Salary"]]  # Selecting specific columns from specific rows

       City  Salary
0    Jaipur   10000
1  ludhiana   15000

In [16]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [17]:
df2.loc[[2,4]]  [["Name","Age"]]  # Selecting specific columns from specific rows

                Name  Age
2             Raghav   31
4  Jashanpreet singh   21

# Conditional Selection

In [18]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   31     Delhi   12000
3       Ankit jangir   40      Agra   18000
4  Jashanpreet singh   21     Noida   20000

If you want to see only those people whose age is greater than 30

In [19]:
df2[df2["Age"] > 30]  # Conditional selection based on a condition

           Name  Age   City  Salary
2        Raghav   31  Delhi   12000
3  Ankit jangir   40   Agra   18000

#I want people whose age is above 30 and their city must be delhi

In [22]:
df2[(df2["Age"]>30) & (df2["City"] == 'Delhi')]  # Conditional selection with multiple conditions

     Name  Age   City  Salary
2  Raghav   31  Delhi   12000